golang/golang-tutor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>golang tutor</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">golang tutor</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74245a0">1. 概述</a>
<ul>
<li><a href="#org48a2297">1.1. workspace</a>
<ul>
<li><a href="#org1b60926">1.1.1. GOPATH 环境变量</a></li>
<li><a href="#orgd3f6f92">1.1.2. 导入路径</a></li>
</ul>
</li>
<li><a href="#org94e0ae1">1.2. repository</a></li>
<li><a href="#org6a33a51">1.3. package</a></li>
<li><a href="#org98d2838">1.4. souce-file</a></li>
</ul>
</li>
<li><a href="#org7e31f56">2. 示例</a>
<ul>
<li><a href="#org9246415">2.1. 命令程序</a></li>
<li><a href="#org4a5c18c">2.2. 库程序</a>
<ul>
<li><a href="#orgc15629a">2.2.1. 测试</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org74245a0" class="outline-2">
<h2 id="org74245a0"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
参阅 <a href="https://golang.org/doc/code.html">How to Write Go Code</a>
</p>

<p>
有三个重要的概念 workspace、repository、pacakge、file：
</p>
<ul class="org-ul">
<li>程序员通常会将所有 Go 代码保存在一个工作区（workspace）中。</li>
<li>工作空间包含许多版本控制存储库（repository）（例如，由 Git 管理）。</li>
<li>每个存储库包含一个或多个包（package）。</li>
<li>每个包由一个目录中的一个或多个 Go 源文件（source-file）组成。</li>
<li>程序包目录的路径决定了其导入路径。</li>
</ul>
</div>

<div id="outline-container-org48a2297" class="outline-3">
<h3 id="org48a2297"><span class="section-number-3">1.1</span> workspace</h3>
<div class="outline-text-3" id="text-1-1">
<p>
工作空间是一个目录层次结构，其根目录有两个目录：
</p>
<ul class="org-ul">
<li>src 包含 Go 源文件。src 子目录通常包含多个版本控制存储库（例如 Git 或 Mercurial），用于跟踪一个或多个源包的开发。</li>
<li>bin 包含可执行命令。go 工具构建二进制文件并将其安装到 bin 目录。</li>
</ul>

<p>
实际上的工作区布局如下：
</p>

<pre class="example">
bin/
    hello                          # command executable
    outyet                         # command executable
src/
    github.com/golang/example/
        .git/                      # Git repository metadata
	hello/
	    hello.go               # command source
	outyet/
	    main.go                # command source
	    main_test.go           # test source
	stringutil/
	    reverse.go             # package source
	    reverse_test.go        # test source
    golang.org/x/image/
        .git/                      # Git repository metadata
	bmp/
	    reader.go              # package source
	    writer.go              # package source
    ... (many more repositories and packages omitted) ...
</pre>

<p>
上面的树显示了一个包含两个存储库（example 和 image）的工作空间。example 存储库包含两个命令（hello 和 outyet）和一个库（stringutffil）。image 存储库包含 bmp 包和其他几个包。
</p>

<p>
典型的工作空间包含许多存储库，每个存储库包含许多包（lib）和命令（command）。大多数 Go 程序员将他们所有的 Go 源代码和依赖项保存在一个工作区中。
</p>

<p>
请注意，不应使用符号链接将文件或目录链接到工作区。命令和库是从不同类型的源包构建的。我们稍后会讨论这种区别。
</p>

<p>
golang规定所有的项目都应该放在同一个workspace下面，如果想要每个项目都把当前目录当做独立的workspace，推荐使用gb 工具。
</p>
</div>

<div id="outline-container-org1b60926" class="outline-4">
<h4 id="org1b60926"><span class="section-number-4">1.1.1</span> GOPATH 环境变量</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
GOPATH 环境变量指定工作区的位置。它默认为主目录中名为 go 的目录，因此在 unix 上为 <code>$HOME/go</code> ，在 Plan 9 上为 <code>$home/go</code> ，在 Windows 上为 <code>％USERPROFILE％\go</code> （通常为  <code>C:\Users\YourName\go</code> ）。
</p>

<p>
如果想在其他位置工作，则需要将 GOPATH 设置为该目录的路径。 （另一种常见的设置是设置 <code>GOPATH=$HOME</code> 。）请注意，GOPATH 不能与 Go 安装的路径相同。
</p>

<p>
命令 <code>go env GOPATH</code> 打印当前生效的 GOPATH；如果未设置环境变量，它将打印默认位置。
</p>

<p>
为方便起见，将工作空间的 bin 子目录添加到 PATH 中：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">export</span> <span style="color: #ff8700;">PATH</span>=$<span style="color: #ff8700;">PATH</span>:$(<span style="color: #fa8072;">go</span> env GOPATH)/bin
</pre>
</div>

<p>
注意：这里的GOPATH如果是多个目录的链表，这样用可能不会有想要的效果。
</p>

<p>
本文档其余部分中的脚本使用 \(GOPATH 而不是 =\)(go env GOPATH)= 。如果你没有设置 GOPATH，要使脚本以书面形式运行，你可以在这些命令中替换 <code>$HOME/go</code> ，否则运行：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">export</span> <span style="color: #ff8700;">GOPATH</span>=$(<span style="color: #fa8072;">go</span> env GOPATH)

</pre>
</div>

<p>
要了解有关 GOPATH 环境变量的更多信息，请参阅“<a href="https://golang.org/cmd/go/#hdr-GOPATH_environment_variable">go help gopath</a>”。
</p>

<p>
要使用自定义工作空间位置，<a href="https://golang.org/wiki/SettingGOPATH">设置 GOPATH 环境变量</a>。
</p>
</div>
</div>

<div id="outline-container-orgd3f6f92" class="outline-4">
<h4 id="orgd3f6f92"><span class="section-number-4">1.1.2</span> 导入路径</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
导入路径是唯一标识包的字符串。包的导入路径对应于其在工作空间内或远程存储库中的位置（如下所述）。
</p>

<p>
标准库中的包具有简短的导入路径，例如“fmt”和“net/http”。对于自己的软件包，必须选择一个基本路径，该路径不太可能与将来添加到标准库或其他外部库中发生冲突。
</p>

<p>
导入路径可以描述如何使用诸如Git或Mercurial之类的修订控制系统来获取包源代码。 go工具使用此属性自动从远程存储库获取包。
</p>

<p>
例如，本文档中描述的示例也保存在GitHub github.com/golang/example上托管的Git存储库中。如果在包的导入路径中包含存储库URL，则get将自动获取，构建和安装它： $
</p>

<div class="org-src-container">
<pre class="src src-sh">go get github.com/golang/example/hello
$<span style="color: #ff8700;">GOPATH</span>/bin/hello
Hello, Go examples!
</pre>
</div>

<p>
果工作空间中不存在指定的包，则get将其放置在GOPATH指定的第一个工作空间内。 （如果包已经存在，请跳过远程提取，其行为与go install相同。）
</p>
</div>
</div>
</div>

<div id="outline-container-org94e0ae1" class="outline-3">
<h3 id="org94e0ae1"><span class="section-number-3">1.2</span> repository</h3>
<div class="outline-text-3" id="text-1-2">
<p>
如果将代码保存在某个源存储库中，则应使用该源存储库的根作为基本路径。例如，如果您在 github.com/user 上有一个 GitHub 帐户，那么这应该是您的基本路径。
</p>

<p>
请注意，在构建代码之前，无需将代码发布到远程存储库。组织代码只是一个好习惯，好像有一天你会发布它一样。实际上，您可以选择任意路径名称，只要它对标准库和更大的 Go 生态系统是唯一的。
</p>
</div>
</div>

<div id="outline-container-org6a33a51" class="outline-3">
<h3 id="org6a33a51"><span class="section-number-3">1.3</span> package</h3>
<div class="outline-text-3" id="text-1-3">
<p>
package是我们最低的引用实体，package名应该与目录名保持一致。
</p>

<p>
一个名为package_name的package中的源码文件都应该位于workspace/repository/package_name目录下，并带有如下说明：
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #a1db00;">package</span> package_name
</pre>
</div>

<p>
然后我们可以如下引用：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #a1db00;">import</span> &lt;repository&gt;/package_name
</pre>
</div>
<p>
go 工具会在GOPATH中所有目录（workspace）下查找名为src/repository/package_name 的目录，使用使用找到的第一进行导入。
</p>
</div>
</div>

<div id="outline-container-org98d2838" class="outline-3">
<h3 id="org98d2838"><span class="section-number-3">1.4</span> souce-file</h3>
<div class="outline-text-3" id="text-1-4">
<p>
同一个package的源码可以分布在多个不同的源码文件中，只要每个源码文件都使用相同的package声明。
</p>
</div>
</div>
</div>

<div id="outline-container-org7e31f56" class="outline-2">
<h2 id="org7e31f56"><span class="section-number-2">2</span> 示例</h2>
<div class="outline-text-2" id="text-2">
<p>
我们将使用 <code>~/golang</code> 作为workspace, 并将该目录添加到 GOPATH 环境变量中。
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir ~/golang &amp;&amp; <span style="color: #d18aff;">export</span> <span style="color: #ff8700;">GOPATH</span>=$(<span style="color: #fa8072;">go</span> env GOPATH):${<span style="color: #ff8700;">HOME</span>}/golang
</pre>
</div>

<p>
注意：如果此前没有设置过环境变量GOPATH 的值，此时该值为 <code>${HOME}/go:${HOME}/golang</code>
</p>
</div>

<div id="outline-container-org9246415" class="outline-3">
<h3 id="org9246415"><span class="section-number-3">2.1</span> 命令程序</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
golang
├── env.sh
└── src
    ├── lang
    │   ├── hello_go
    │   │   └── main.go

</pre>

<p>
<a href="https://github.com/phenix3443/test/blob/master/golang/src/lang/hello-go/main.go">main.go</a>
</p>

<p>
然后现在可以编译并运行项目：
</p>

<div class="org-src-container">
<pre class="src src-sh">go install lang/hello_go
</pre>
</div>

<p>
注意：可以在系统任何位置运行该命令，go tool将会查找GOPATH中所有目录，找到第一个 <code>src/lang/hello-go</code> 的子目录，然后进行编译，并将编译结果放入对应workspace的bin目录下。例子中，生成的hello_go程序放在 ${HOME}/golang/bin 目录下。
</p>
</div>
</div>

<div id="outline-container-org4a5c18c" class="outline-3">
<h3 id="org4a5c18c"><span class="section-number-3">2.2</span> 库程序</h3>
<div class="outline-text-3" id="text-2-2">
<p>
下面编写一个简单的数学库mymath用作测试，代码目录：
</p>
<pre class="example">
golang/
├── bin
│   └── hello_go
├── build.sh
└── src
    ├── lang
    │   ├── hello_go
    │   │   └── main.go
    │   └── mymath
    │       ├── add.go
    │       └── add_test.go


</pre>

<p>
代码参见 <a href="https://github.com/phenix3443/test/tree/master/golang/src/lang/mymath">mymath</a>，然后我们执行编译：
</p>

<div class="org-src-container">
<pre class="src src-sh">go build lang/mymath
</pre>
</div>
<p>
同样，该命令可以在系统的任何位置执行。它不会产生输出文件。相反，它将已编译的包保存在本地构建缓存中。
</p>
</div>

<div id="outline-container-orgc15629a" class="outline-4">
<h4 id="orgc15629a"><span class="section-number-4">2.2.1</span> 测试</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Go有一个由go test命令和测试包组成的轻量级测试框架。通过创建名称以 <code>_test.go</code> 结尾的文件来编写测试，该文件包含名为 <code>TestXXX</code> 且签名为 <code>func(t * testing.T)</code> 的函数。测试框架运行每个这样的函数；如果函数调用失败函数（如t.Error或t.Fail），则认为测试失败。通过创建包含以下Go代码的文件 <code>workspace/src/lang/mymath/add_test.go</code> ，将测试添加到mymath包中。
</p>

<p>
执行测试：
</p>
<div class="org-src-container">
<pre class="src src-sh">go test lang/mymath
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:35</p>
<p class="validation"></p>
</div>
</body>
</html>
